#coding:UTF-8
import chardet

alphabet = u' #%&*+-./0123456789<=>@ABCDEFGHIKLMNOPRSTUVWY[]^abcdefgilmnopstuxy×β—“”Ⅲ↑↓一三丙中临为乙乳二五亚产人仅伤位低住体余便促值偶儿光免冲准凝分别前剩力功动化单危压原参及反发变叶号合同名含告嗜围固国均型备大女姓学定实审室容宽对小尿差巴布带常干平年床序应度开异弱形微心志快急性总成房所抑抗报据收数断新方旁旋时明有未本机板析果查柱标核根梅检棕毒比气氢氧氨氮氯法注活浆测浓液淀淋清游滋潜激点物特状率球生甲男疫病瘤癌白的盐目着砷硝碘碱碳离种科秒积称签算类粉粒糖系素红纤细终结绝维缓缺考者联聚肌肝肾肿胆胎胚胞胱胶能脱脲腺色艾范草萄葡蛋螺血表褐见规解计诊试该说谷负责质贫转软输通速部酐酮酶酸醇采重量鉴钙钠钾铁镜门间阳阴际降院陷集面项颜饱验高黄龄（）：'

#alphabet = u' 0123456789丘东丹为乐二仁伟佳健光兰兴军卫君国大媛室家峰幢平年庄庆建彦彬忠惟慧成才文斌新方施旦明晓晚景朱李村来椿步民江沈洪海滨炳熙燕爱王琪琳盛石蒋虎观许超阿霞静香'

#alphabet = u' #%&*+-./0123456789<=>@ABCDEFGHIKLMNOPRSTUVWY[]^abcdefgilmnopstuxy×β—“”Ⅲ↑↓一三丙中临为乙乳二五亚产人仅伤位低住体余便促值偶儿光免冲准凝分别前剩力功动化单危压原参及反发变叶号合同名含告和嗜围固国均型备大女姓学定实审室容宽对小尿差巴布带常干平年床序应度开异形微心志快急性总成房所抑抗报据收数断新方旁旋时明有未本机板析果查柱标核根梅检棕毒比气氢氧氨氮氯法注活浆测浓液淀淋清游滋潜激点物特状率球生甲男疫病瘤癌白的盐目着砷硝碘碱碳离种科秒积称签算类粉粒糖系素红纤细终结绝维缓缺考者联聚肌肝肾肿胆胎胚胞胱胶能脱脲腺色艾范草萄葡蛋螺血表褐见规解计诊试该说谷负责质贫转软输通速部酐酮酶酸醇采重量鉴钙钠钾铁镜门间阳阴际降院陷集面项颜饱验高黄龄（）：'
#sig = u''
#sig = sig.encode('utf8')
#for word in alphabet:
#    #word = word.encode('utf8')
#    if word not in sig:
#        print word#'type: ',chardet.detect(bytes(word))
#print len(alphabet)
